In [45]:
# P(A/B) = ( P(B/A) * P(A) ) / P(B)

import pandas as pd
titanicUrl = 'https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv'
df = pd.read_csv(titanicUrl)
df.head()

# P(Survived / (Male & Class & Age & Cabin & Fare))

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [46]:
df.drop(['PassengerId','Name', 'SibSp', 'Parch', 'Ticket', 'Cabin','Embarked'], axis = 'columns', inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [47]:
target = df.Survived
inputs = df.drop('Survived', axis = 'columns')

In [48]:
#from sklearn.preprocessing import LabelEncoder
#le_Sex = LabelEncoder()
#inputs['sex_n'] = le_Sex.fit_transform(inputs['Sex'])
#inputs.drop(['Sex'], axis='columns')
#inputs.head()
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [49]:
inputs = pd.concat([inputs,dummies],axis = 'columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [50]:
inputs.drop('Sex', axis = 'columns', inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0

In [51]:
#Check NaN
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [52]:
import math
inputs.Age = df.Age.fillna(df.Age.mean())
inputs.columns[inputs.isna().any()]
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [79]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(inputs,target,test_size = 0.2)

In [80]:
len(X_train)

712

In [81]:
len(X_test)

179

In [82]:
#Create naive Bayes model
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [83]:
model.fit(X_train,y_train)

GaussianNB()

In [84]:
model.score(X_test,y_test)

0.8268156424581006

In [85]:
X_test[:10]

     Pclass        Age     Fare  female  male
424       3  18.000000  20.2125       0     1
703       3  25.000000   7.7417       0     1
1         1  38.000000  71.2833       1     0
13        3  39.000000  31.2750       0     1
312       2  26.000000  26.0000       1     0
560       3  29.699118   7.7500       0     1
603       3  44.000000   8.0500       0     1
828       3  29.699118   7.7500       0     1
515       1  47.000000  34.0208       0     1
442       3  25.000000   7.7750       0     1

In [86]:
y_test[:10]

424    0
703    0
1      1
13     0
312    0
560    0
603    0
828    1
515    0
442    0
Name: Survived, dtype: int64

In [87]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 1, 0, 0, 0, 0, 0], dtype=int64)

In [88]:
model.predict_proba(X_test[:10])

array([[0.98159725, 0.01840275],
       [0.98383174, 0.01616826],
       [0.00352514, 0.99647486],
       [0.98362399, 0.01637601],
       [0.03334541, 0.96665459],
       [0.98467513, 0.01532487],
       [0.98553046, 0.01446954],
       [0.98467513, 0.01532487],
       [0.88846499, 0.11153501],
       [0.98383323, 0.01616677]])